src/cf/Documents/ВходящийHTTPЗапрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВходящийHTTPЗапрос</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Comment>Код состояния отправляемого ответа на полученный запрос</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ОтветВнешнегоСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ОтветВнешнегоСервиса</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Comment>Код состояния, полученный в результате запроса к внешнему сервису</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ОбщегоНазначенияHTTP/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОтветJSON(Объект, КодСостояния = 200) Экспорт
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	
	Ответ.Заголовки.Вставить("Content-Type", ТипКонтентаJSON());
	Ответ.УстановитьТелоИзСтроки(КоннекторHTTP.ОбъектВJson(Объект));
	
	Возврат Ответ;
КонецФункции

Функция ПростойУспешныйОтвет() Экспорт
	Результат = Новый Структура("result", "ok");
	
	Возврат ОтветJSON(Результат);
КонецФункции

Функция ОтветОбОшибке(ИнформацияОбОшибке) Экспорт
	ЗаписьЖурналаРегистрации(
		"HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)
	);
	
	Результат = Новый Структура("result, errorText", "error", КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	Возврат ОтветJSON(Результат, 500);
КонецФункции

Процедура ЗаписатьЛогДляВходящегоHTTPЗапроса(ИмяМетода, Запрос, Ответ) Экспорт
	НовыйДокумент = Документы.ВходящийHTTPЗапрос.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ИмяМетода = ИмяМетода;
	НовыйДокумент.КодСостояния = Ответ.КодСостояния;
	НовыйДокумент.ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	НовыйДокумент.ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	НовыйДокумент.Записать();
КонецПроцедуры

Процедура ЗаписатьЛогДляОтветаВнешнегоСервиса(ИмяМетода, Ответ) Экспорт
	НовыйДокумент = Документы.ОтветВнешнегоСервиса.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ИмяМетода = ИмяМетода;
	НовыйДокумент.КодСостояния = Ответ.КодСостояния;
	
	ТипТелаОтвета = ТипЗнч(Ответ.Тело);
	Если ТипТелаОтвета = Тип("ДвоичныеДанные") Тогда
		НовыйДокумент.ТелоОтвета = КоннекторHTTP.КакТекст(Ответ);
	ИначеЕсли ТипТелаОтвета = Тип("Строка") Тогда
		НовыйДокумент.ТелоОтвета = Ответ.Тело;
	КонецЕсли;
	
	НовыйДокумент.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипКонтентаJSON()
	Возврат "application/json";
КонецФункции

#КонецОбласти
